Revit 2026 API

# FieldBuilder(FieldBuilder) Constructor

---

Constructs a new copy of the input ESFieldBuilder object.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FieldBuilder(
	FieldBuilder other
)
```
```vb
Public Sub New (
	other As FieldBuilder
)
```
```cpp
public:
FieldBuilder(
	FieldBuilder^ other
)
```
```fsharp
new :
        other : FieldBuilder -> FieldBuilder
```

#### Parameters

other FieldBuilder

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FieldBuilder Class

FieldBuilder Overload

Autodesk.Revit.DB.ExtensibleStorage Namespace